Тест/Тест/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПеремещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеТовара</name>
      <type>
        <types>EnumRef.СтатусыПеремещений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Enums/СтатусыПеремещений/СтатусыПеремещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПеремещений</name>
  <enumValues>
    <name>Заказано</name>
  </enumValues>
  <enumValues>
    <name>Собрано</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>НаПриёме</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>НетВНаличии</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Свойство("НомерСтроки") Тогда
		Элементы.Товары.ТекущаяСтрока = Параметры.НомерСтроки - 1;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборСтроки") Тогда
		СтрокиТаблицы = Объект.Товары.НайтиСтроки(Параметры.ОтборСтроки);
		Если СтрокиТаблицы.Количество() <> 0 Тогда
			Элементы.Товары.ТекущаяСтрока = СтрокиТаблицы[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьФункциональныеОпции();
	
	ОбновитьРасчетныеПоказатели();
	
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ОбновитьРасчетныеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Перем Команда;
	Перем деталь;
	Перем код;

	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение.Свойство("Команда", Команда);
        Если Команда = "ПравильныйПоиск"   Тогда
           ВыбранноеЗначение.Свойство("Код", код);
		   ВыбранноеЗначение.Свойство("деталь", деталь);
		   ДобавлениеЗапчасти(код,деталь);
	   КонецЕсли
   КонецЕсли
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	
	СкладПриИзмененииНаСервере(Элемент.Имя, "Ответственный");
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	
	СкладПриИзмененииНаСервере(Элемент.Имя, "Проверяющий");
	
	ОбновитьФункциональныеОпции();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура СкладПриИзмененииНаСервере(ИмяРеквизитаСклад, ИмяРеквизитаОтветственный)
	
	Склад = Объект[ИмяРеквизитаСклад];
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		Возврат
	КонецЕсли;
	
	Объект[ИмяРеквизитаОтветственный] = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "Ответственный");

	Если ИмяРеквизитаСклад = "СкладОтправитель" Тогда
		ОбновитьМестаХранения();
	КонецЕсли;

КонецПроцедуры // СкладПриИзмененииНаСервере()



&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ОбновитьМестаХранения();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Товары

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	СвойстваСтроки = Новый Структура();
	СвойстваСтроки.Вставить("Дата", Объект.Дата);
	СвойстваСтроки.Вставить("Склад", Объект.СкладОтправитель);
	СвойстваСтроки.Вставить("Номенклатура", ТекСтрока.Товар);
	
	ТаблицаТоварПриИзмененииСервер(СвойстваСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекСтрока, СвойстваСтроки, "МестоХранения");
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаТоварПриИзмененииСервер(ДанныеЗаполнения)
	ДанныеЗаполнения.Вставить("МестоХранения", дт_АдресноеХранение.ПолучитьМестоХранения(ДанныеЗаполнения));	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ОбновитьОбщЦену();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОбновитьОбщЦену();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыОбщЦенаПриИзменении(Элемент)
	ОбновитьОбщЦену();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Добавить(Команда)
	// Вставить содержимое обработчика.
	Форма = ПолучитьФорму("Обработка.ВыборНоменклатуры.Форма");
	Форма.ВладелецФормы = ЭтаФорма;       
	Форма.Открыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьРасчетныеПоказатели()
	
	ОбновитьместаХранения();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМестаХранения() Экспорт
	
	// Это старое место хранения ////дт_АдресноеХранение.ЗаполнитьМестаХранения(ЭтаФорма, "СкладОтправитель", "Товары", "Товар");
	Для Каждого Строка ИЗ Объект.Товары Цикл 
		
		Если ЗначениеЗаполнено(Строка.Партия) Тогда 
			
			Строка.МестоХраненияПартии = ПолучитьМестоХраненияПартии(Строка.Партия);
			
		КонецЕсли ;
		
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМестоХраненияПартии(Партия)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИндНомер.Стеллаж КАК Стеллаж
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|ГДЕ
		|	ИндНомер.индкод = &индкод";
	
	Запрос.УстановитьПараметр("индкод", Партия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() ТОгда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Стеллаж; 
	Иначе
		Возврат Справочники.ИндКод.ПустаяСсылка();
	КонецЕсли ;

КонецФункции


&НаСервере
Процедура  ДобавлениеЗапчасти(код,деталь)
	Товар = Справочники.Номенклатура.НайтиПоКоду(код);
	Строка = Объект.Таблица.Добавить();
	Строка.Товар = Товар;
	Строка.Цена = деталь.Цена;
	Строка.Количество = 0;
КонецПроцедуры



&НаСервере
Процедура ОбновитьОбщЦену()
	Объект.Итого = 0;
	Для Каждого ТекСтрокаТаблица Из Объект.Товары Цикл
		ТекСтрокаТаблица.ОбщЦена =  ТекСтрокаТаблица.Цена * ТекСтрокаТаблица.Количество;
		Объект.Итого = Объект.Итого + ТекСтрокаТаблица.ОбщЦена;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Документы.ПеремещениеТоваров.ПолучитьМакет(название);
КонецФункции





&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ДоступныеСтатусы = Элементы.Статус.СписокВыбора;
	ДоступныеСтатусы.Очистить();
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПеремещений.ВРаботе"));
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПеремещений.Отправлен"));
	ДоступныеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыПеремещений.КОтправке"));
	
	
	СтатусПринят = ПредопределенноеЗначение("Перечисление.СтатусыПеремещений.Принят");
	Если Форма.ЕстьПравоПриемки 
		ИЛИ Объект.Статус = СтатусПринят Тогда
		
		ДоступныеСтатусы.Добавить(СтатусПринят);
		
	КонецЕсли;
	
	//Элементы.Статус.СписокВыбора = ДоступныеСтатусы;

КонецПроцедуры // УправлениеФормой()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ОбновитьФункциональныеОпции()

	ЕстьПравоПриемки = Пользователи.ЭтоПолноправныйПользователь()
		ИЛИ РольДоступна("дт_ПриемкаПеремещений");
	
	Если НЕ ЕстьПравоПриемки 
		И ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
		Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СкладПолучатель, "Ответственный");
		
		Если ЗначениеЗаполнено(Ответственный) Тогда
			ЕстьПравоПриемки = Пользователи.ТекущийПользователь() = Ответственный;
		КонецЕсли;
	КонецЕсли;
		
КонецФункции // ЕстьПравоПриемки()

#КонецОбласти
